{
  "backend/main.mo": "Motoko actor defining the backend for MediAI, with data types and CRUD operations for user profiles, prescriptions, medication reminders, drug interactions, diet records, hospital records, and price records, protected by caller-based authorization checks.",
  "feature_evidence.json": "Feature evidence report listing implemented features with their IDs, titles, associated file paths, component dependencies, and test IDs for the MediAI frontend hooks, dashboard, medicine comparison, drug interaction checker, profile setup, and navbar.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to one-sentence descriptions summarizing the purpose of each component or hook in the MediAI frontend.",
  "frontend/index.css": "Global Tailwind CSS entry point that defines CSS custom property design tokens for light and dark themes including colors, radius, chart palette, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the MediAI React app, mounting the root div and loading the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that composes all page sections (Hero, Features, Tools, Dashboard, etc.), manages light/dark theme toggling, and renders the ProfileSetup modal overlay and floating AI chat assistant.",
  "frontend/src/components/AIChatAssistant.tsx": "Floating chat assistant component fixed to the bottom-right corner with a toggle orb, glassmorphism chat panel, simulated AI responses with typing delay, and keyboard-accessible message input.",
  "frontend/src/components/CursorTrail.tsx": "Custom cursor trail component that renders a neon ring cursor, center dot, and fading radial-gradient particle trail on mouse movement, disabled automatically on touch/mobile devices.",
  "frontend/src/components/Dashboard.tsx": "A tabbed dashboard component displaying prescriptions, reminders, drug interactions, and diet history for an authenticated user, with support for deleting and updating records via React Query mutations.",
  "frontend/src/components/DatasetsValidation.tsx": "A landing page section that displays animated metric bars (Precision, Recall, F1 Score, User Comprehension) with scroll-triggered animations to showcase model validation results.",
  "frontend/src/components/DrugInteractionChecker.tsx": "A form component that accepts 2–5 medication names, generates mock drug interaction warnings, and saves the results to the backend via a mutation if the user is authenticated.",
  "frontend/src/components/Features.tsx": "A landing page section rendering a grid of 3D-tilt feature cards with icons and descriptions highlighting the platform's core capabilities like prescription analysis, dietary guidance, and multilingual support.",
  "frontend/src/components/Hero.tsx": "The main hero section of the landing page featuring a headline, subheading, CTA buttons for uploading prescriptions or analyzing reports, and an embedded PrescriptionUploader component.",
  "frontend/src/components/MedicineComparison.tsx": "A React component that lets users search for a medicine and displays links to its search results on three Indian pharmacy sites (1mg, PharmEasy, Netmeds). If the user is authenticated via Internet Identity, it also saves the comparison results to the backend using a mutation hook.",
  "frontend/src/components/Motivation.tsx": "A landing-page section component that renders animated stats (accuracy, languages, alerts) alongside an HTML5 canvas-based animated brain/neural-network visualization. It uses a scroll animation hook to trigger entrance effects.",
  "frontend/src/components/Navbar.tsx": "A fixed top navigation bar with smooth-scroll links, a light/dark theme toggle, and Internet Identity login/logout functionality. It displays a truncated principal ID when authenticated and collapses into a hamburger menu on mobile.",
  "frontend/src/components/NoveltyScalability.tsx": "A landing-page section that showcases integration targets (Hospital, Pharmacy, Mobile, EHR, Telemedicine) using an animated HTML5 canvas orbit-network diagram with rotating nodes and traveling particles. It also lists integration cards with scroll-triggered animations.",
  "frontend/src/components/PrescriptionUploader.tsx": "A drag-and-drop file upload component for prescription images/PDFs that simulates a scanning progress animation and transitions through idle, dragging, scanning, and complete states with corresponding visual feedback.",
  "frontend/src/components/ProblemStatement.tsx": "Renders a landing page section highlighting three healthcare communication problems (Low Health Literacy, Medication Errors, High Anxiety) using animated glass-style cards with icons and scroll animations.",
  "frontend/src/components/ProfileSetup.tsx": "Displays a modal dialog for first-time authenticated users to set up their name and email profile, saving it via a mutation hook and only showing when no profile exists.",
  "frontend/src/components/ProposedMethod.tsx": "Renders an animated AI pipeline flow diagram showing five steps (OCR → Medical NLP → RAG Pipeline → Drug Interaction → Simplified Output) with traveling particle animations and responsive desktop/mobile layouts.",
  "frontend/src/components/ThreeJsBackground.tsx": "Creates an interactive Three.js animated background featuring a neural network node graph, floating particles, and a heartbeat waveform that responds to mouse movement, with optional light/dark mode color schemes.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries whenever the user's identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider for ICP, exposing login/logout functions, identity state, and login status via a React context hook backed by DFINITY's AuthClient.",
  "frontend/src/hooks/useMediAIQueries.ts": "Provides React Query hooks for all MediAI backend operations including user profile, prescriptions, reminders, drug interactions, diet records, hospital records, and price records using the actor pattern.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file with no implementation, indicating no backend queries are needed for the static frontend.",
  "frontend/src/hooks/useScrollAnimation.ts": "Exports two custom hooks, useScrollAnimation and useStaggerAnimation, that use IntersectionObserver to trigger CSS visibility animations when elements scroll into view.",
  "frontend/src/index.css": "Global stylesheet defining the dark futuristic theme with CSS custom properties for colors, glassmorphism, neon glow effects, light mode overrides, and reusable component utility classes via Tailwind layers.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom navy/neon color palettes, glassmorphism shadows, futuristic keyframe animations, and OKLCH-based semantic color tokens mapped to CSS variables.",
  "project_state.json": "Project state manifest describing the MediAI application's architecture, existing features, tech stack (React frontend, Node.js/Express backend, PostgreSQL, Redis, AI/OCR integrations), and versioned feature list."
}